import React, { useState } from 'react';
import { useNavigate } from 'react-router-dom';

export default function New({inputs}) {
  //   const inputHandler = (e) => {
  //     setinputs((prev) => ({ ...prev, [e.target.name]: e.target.value }));
  //   };

  //   const submitHAndler = (e) => {
  //     e.preventDefault();

  //     if (inputs.nameOfTarget && inputs.nameOfTeam && inputs.nameOfCouch && inputs.nameOfSome) {
  //       fetch('/', {
  //         method: 'POST',
  //         headers: {
  //           'Content-type': 'application/json',
  //         },
  //         body: JSON.stringify(inputs),
  //       })
  //         .then(navigate('/'));
  //     }
  //   };

  return (
    <>
     <div>
        Привет, {inputs.name}!
        И добро пожаловать в команду {inputs.nameOfTeam}!
        Впереди нас ждет интересное путешествие в мир нашей компании, и самым главным проводником будет- {inputs.nameOfCouch}
        Мы подготовили для тебя {inputs.nameOfSome}. Процесс выполнения будет сохраняться, поэтому ты можешь закрывать пункты в удобном для тебя порядке.

        Нужно подготовить твое рабочее место:
        Наставник выдал мне пропуск
        Наставник сообщил пароль от Wi-Fi
        Системный администратор выдал мне ноутбук
        Системный администратор выдал мне доступы к почте
        Ты отправил(-а) офис-менеджеру на почту список необходимой для тебя канцелярии

        Важно познакомиться с коллегами:
        Ты познакомился (-ась) со своим руководителем
        Ты написал(-а) сообщение в командный чат
        Напиши имена трех твоих коллег по отделу: ____________

        Важно пройти оформление в отделе кадров:
        Ты отправил (-а)  сканды документы на оформление в отдел кадров
        Ты подписал (-а) соглашение о коммерческой тайне

        А теперь самое время работать:
        Получи свою первую задачу у руководителя
        Создай подпись в почте по корпоративному шаблону

        Классного путешествия!
        Команда {inputs.nameOfTeam} 💚

      </div>
    </>
  );
}
